ams/src/Documents/AMS_ЛогистическийЛист/AMS_ЛогистическийЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ЛогистическийЛист</name>
  <registerRecords>InformationRegister._Рейсы</registerRecords>
  <registerRecords>InformationRegister._РейсыРаспоряжения</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаВодителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПропуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗагрузкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВМаршруте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединеннаяЗагрузка</name>
      <type>
        <types>DocumentRef.AMS_ОбъединеннаяЗагрузка</types>
      </type>
    </attributes>
    <attributes>
      <name>Распоряжение</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <types>DocumentRef.AMS_ПередачаВПереработку</types>
        <types>DocumentRef.ОтгрузкаТоваровКлиенту</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодАдресаДоставки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьЧек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьНарушениеДоговора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьПретензия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтменыДоставки</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратыТоваров</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтменыДоставки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>EnumRef._ПричиныОтменыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРаспоряжения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияЗаказа</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЧека</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктДоговора</name>
      <type>
        <types>EnumRef._ПунктыДоговора</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаШтрафа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержаниеПретензии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПретензии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подвоз</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/InformationRegisters/AMS_ИсторияРеализации/AMS_ИсторияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AMS_ИсторияРеализации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Операция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>EnumRef.AMS_СобытияРеализации</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <types>EnumRef.AMS_СтатусыРеализаций</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийЛист</name>
    <type>
      <types>DocumentRef.AMS_ЛогистическийЛист</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/Enums/_СтатусыДоставки/_СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыДоставки</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/AMS_СобытияРеализации/AMS_СобытияРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СобытияРеализации</name>
  <enumValues>
    <name>Запись</name>
  </enumValues>
  <enumValues>
    <name>Проведение</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПроведения</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Погрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПогрузки</name>
  </enumValues>
  <enumValues>
    <name>РазрешитьОтгрузку</name>
  </enumValues>
  <enumValues>
    <name>ОтменаРазрешенияОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ПечатьСН</name>
  </enumValues>
  <enumValues>
    <name>ПечатьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ПечатьУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтменаПечати</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/AMS_ЛогистическийЛист/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Организация = AMS_ВызовСервера.ПолучитьОсновнуюОрганизацию();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Погрузка   = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Погрузка");
	Отправлено = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._СтатусыДоставки.Отправлено");

	МассивНепроверяемыхРеквизитов = Новый Массив;

	Если Статус = Погрузка Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Рейсы.Отправлено");
	КонецЕсли;

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	Если мср.ЭтоПервыйЛогистическийЛист(Дата, Ссылка) Тогда
		Дата = НачалоДня(Дата) + 12 * 3600;
	Иначе
		Дата = НачалоДня(Дата) + 13 * 3600;
	КонецЕсли;

	Для Каждого Стр Из Рейсы Цикл
		Если Статус = Погрузка И Стр.Пробег = 0 Тогда
			Текст = "Доставка. Для транспорта " + Стр.ТранспортноеСредство + " в колонке ""Км"" не указан пробег.";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЕсли;

		Если Статус = Отправлено Тогда
			Если Стр.ВремяЗагрузкиФакт = Дата('00010101') Тогда
				Текст = "Доставка. Для транспорта " + Стр.ТранспортноеСредство
					+ " в колонке ""Факт"" не указано фактическое время начала загрузки.";
				ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
			КонецЕсли;

			Если Стр.Отправлено = Дата('00010101') Тогда
				Текст = "Доставка. Для транспорта " + Стр.ТранспортноеСредство
					+ " в колонке ""Отправлено"" не указано время отправки груза.";
				ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если Статус = Погрузка Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Распоряжения", Распоряжения.Выгрузить( , "Распоряжение"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&Распоряжения КАК т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Распоряжение КАК Распоряжение
		|ИЗ
		|	вт КАК вт
		|ГДЕ
		|	вт.Распоряжение.AMS_Вес = 0";

		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();

		Пока Выб.Следующий() Цикл
			Текст = "В " + Выб.Распоряжение + " не указана ВЕС товара.";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЦикла;
	КонецЕсли;

	Если Статус = Отправлено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Распоряжения", Распоряжения.Выгрузить( , "Распоряжение"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	т.Распоряжение КАК Распоряжение
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	&Распоряжения КАК т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Распоряжение КАК Распоряжение
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реал
		|		ПО вт.Распоряжение = Реал.Ссылка
		|ГДЕ
		|	НЕ Реал.AMS_УтвержденаОтгрузка";

		Рез = Запрос.Выполнить();
		Выб = Рез.Выбрать();

		Пока Выб.Следующий() Цикл
			Текст = "Документ " + Выб.Распоряжение + " не разрешён к отгрузке.";
			ОбщегоНазначения.СообщитьПользователю(Текст, , , , Отказ);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЗаписатьРегистры();
	ЗаписатьРегистрыСведенийИсторияРеализации();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПустаяСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Документ.AMS_ЛогистическийЛист.ПустаяСсылка");

	Для Каждого Стр Из Распоряжения Цикл
		Если ТипЗнч(Стр.Распоряжение) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Стр.Распоряжение, 
				Перечисления.AMS_СобытияРеализации.ОтменаПогрузки,,ПустаяСсылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуРаспоряжений(Табл, ПалетРеал, ВесРеал) Экспорт
	Табл.Очистить();
	ПалетРеал   = 0; //Для вывода в подвал таблицы
	ВесРеал     = 0; //Для вывода в подвал таблицы
	НомерСтроки = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Распоряжения", Распоряжения.Выгрузить(, "Распоряжение"));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ УжеТут
	|ИЗ
	|	&Распоряжения КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ УжеЕсть
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ЛогистическийЛист КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ д.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УжеЕсть.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ДокИзЛиста1
	|ИЗ
	|	УжеЕсть КАК УжеЕсть
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УжеТут.Распоряжение
	|ИЗ
	|	УжеТут КАК УжеТут
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокИзЛиста1.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ ДокИзЛиста
	|ИЗ
	|	ДокИзЛиста1 КАК ДокИзЛиста1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиента.Ссылка КАК Распоряжение,
	|	НАЧАЛОПЕРИОДА(ЗаказКлиента.ДатаОтгрузки, ДЕНЬ) КАК ДатаОтгрузки,
	|	ЗаказКлиента.ВремяДоставкиС КАК ВремяДоставкиС,
	|	ЗаказКлиента.ВремяДоставкиПо КАК ВремяДоставкиПо,
	|	ЗаказКлиента.ЗонаДоставки КАК ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА ЗаказКлиента.АдресДоставкиПеревозчика
	|		ИНАЧЕ ЗаказКлиента.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.AMS_КоличествоПалет КАК КоличествоПалет,
	|	ЗаказКлиента.AMS_КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	ЗаказКлиента.AMS_Вес КАК Вес,
	|	ЗаказКлиента.AMS_ВесПлан КАК ВесПлан,
	|	ЗаказКлиента.AMS_Объем КАК Объем,
	|	ЛОЖЬ КАК Подвоз,
	|	ЛОЖЬ КАК УтвержденаОтгрузка,
	|	ЗаказКлиента.ПеревозчикПартнер КАК ПеревозчикПартнер,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Проведен
	|	И ЗаказКлиента.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОбеспечению))
	|	И ЗаказКлиента.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки))
	|	И ЗаказКлиента.ДатаОтгрузки МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реал.Ссылка,
	|	НАЧАЛОПЕРИОДА(Реал.Дата, ДЕНЬ),
	|	Реал.ВремяДоставкиС,
	|	Реал.ВремяДоставкиПо,
	|	Реал.ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА Реал.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА Реал.АдресДоставкиПеревозчика
	|		ИНАЧЕ Реал.АдресДоставки
	|	КОНЕЦ,
	|	Реал.Номер,
	|	Реал.Дата,
	|	Реал.СуммаДокумента,
	|	Реал.Партнер,
	|	Реал.AMS_КоличествоПалет,
	|	Реал.AMS_КоличествоПалетПлан,
	|	Реал.AMS_Вес,
	|	Реал.AMS_ВесПлан,
	|	Реал.AMS_Объем,
	|	ЛОЖЬ,
	|	Реал.AMS_УтвержденаОтгрузка,
	|	Реал.ПеревозчикПартнер,
	|	2
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реал
	|ГДЕ
	|	Реал.Проведен
	|	И Реал.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки))
	|	И Реал.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Отгрузка.Ссылка,
	|	НАЧАЛОПЕРИОДА(Отгрузка.Дата, ДЕНЬ),
	|	Отгрузка.ВремяДоставкиС,
	|	Отгрузка.ВремяДоставкиПо,
	|	Отгрузка.ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА Отгрузка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА Отгрузка.АдресДоставкиПеревозчика
	|		ИНАЧЕ Отгрузка.АдресДоставки
	|	КОНЕЦ,
	|	Отгрузка.Номер,
	|	Отгрузка.Дата,
	|	Отгрузка.СуммаДокумента,
	|	Отгрузка.Партнер,
	|	Отгрузка.AMS_КоличествоПалет,
	|	Отгрузка.AMS_КоличествоПалетПлан,
	|	Отгрузка.AMS_Вес,
	|	Отгрузка.AMS_ВесПлан,
	|	Отгрузка.AMS_Объем,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Отгрузка.ПеревозчикПартнер,
	|	3
	|ИЗ
	|	Документ.ОтгрузкаТоваровКлиенту КАК Отгрузка
	|ГДЕ
	|	Отгрузка.Проведен
	|	И Отгрузка.СпособДоставки В (ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу),
	|		ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки))
	|	И Отгрузка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Маркетплейс.Ссылка,
	|	Маркетплейс.Дата,
	|	Маркетплейс.ВремяДоставкиС,
	|	Маркетплейс.ВремяДоставкиПо,
	|	Маркетплейс.ЗонаДоставки,
	|	Маркетплейс.АдресДоставки,
	|	Маркетплейс.Номер,
	|	Маркетплейс.Дата,
	|	Маркетплейс.СуммаДокумента,
	|	Маркетплейс.Партнер,
	|	Маркетплейс.AMS_КоличествоПалет,
	|	Маркетплейс.AMS_КоличествоПалет,
	|	Маркетплейс.AMS_Вес,
	|	Маркетплейс.AMS_Вес,
	|	Маркетплейс.AMS_Объем,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	Маркетплейс.ПеревозчикПартнер,
	|	4
	|ИЗ
	|	Документ.ПередачаТоваровХранителю КАК Маркетплейс
	|ГДЕ
	|	Маркетплейс.Проведен
	|	И НЕ (Маркетплейс.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|	ИЛИ Маркетплейс.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика))
	|	И Маркетплейс.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВПереработку.Ссылка,
	|	ВПереработку.Дата,
	|	ВПереработку.ВремяДоставкиС,
	|	ВПереработку.ВремяДоставкиПо,
	|	ВПереработку.ЗонаДоставки,
	|	ВПереработку.АдресДоставки,
	|	ВПереработку.Номер,
	|	ВПереработку.Дата,
	|	0,
	|	ВПереработку.Партнер,
	|	ВПереработку.AMS_КоличествоПалет,
	|	ВПереработку.AMS_КоличествоПалет,
	|	ВПереработку.AMS_Вес,
	|	ВПереработку.AMS_Вес,
	|	ВПереработку.AMS_Объем,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВПереработку.Партнер,
	|	5
	|ИЗ
	|	Документ.AMS_ПередачаВПереработку КАК ВПереработку
	|ГДЕ
	|	ВПереработку.Проведен
	|	И ВПереработку.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ ВПереработку.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.ДатаПоступления,
	|	ЗаказПоставщику.ВремяДоставкиС,
	|	ЗаказПоставщику.ВремяДоставкиПо,
	|	ЗаказПоставщику.ЗонаДоставки,
	|	ЗаказПоставщику.АдресДоставки,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.СуммаДокумента,
	|	ЗаказПоставщику.Партнер,
	|	ЗаказПоставщику.AMS_КоличествоПалет,
	|	ЗаказПоставщику.AMS_КоличествоПалет,
	|	ЗаказПоставщику.AMS_Вес,
	|	ЗаказПоставщику.AMS_Вес,
	|	ЗаказПоставщику.AMS_Объем,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЗаказПоставщику.ПеревозчикПартнер,
	|	6
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.НашимиСиламиСАдресаОтправителя)
	|	И ЗаказПоставщику.Проведен
	|	И НЕ ЗаказПоставщику.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаказПоставщику.ДатаПоступления МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Ссылка,
	|	ЗаявкаНаВозврат.ДатаПоступления,
	|	ЗаявкаНаВозврат.ВремяДоставкиС,
	|	ЗаявкаНаВозврат.ВремяДоставкиПо,
	|	ЗаявкаНаВозврат.ЗонаДоставки,
	|	ЗаявкаНаВозврат.АдресДоставки,
	|	ЗаявкаНаВозврат.Номер,
	|	ЗаявкаНаВозврат.Дата,
	|	ЗаявкаНаВозврат.СуммаДокумента,
	|	ЗаявкаНаВозврат.Партнер,
	|	ЗаявкаНаВозврат.AMS_КоличествоПалет,
	|	ЗаявкаНаВозврат.AMS_КоличествоПалет,
	|	ЗаявкаНаВозврат.AMS_Вес,
	|	ЗаявкаНаВозврат.AMS_Вес,
	|	ЗаявкаНаВозврат.AMS_Объем,
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЗаявкаНаВозврат.ПеревозчикПартнер,
	|	7
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.Проведен
	|	И НЕ ЗаявкаНаВозврат.ДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
	|	И ЗаявкаНаВозврат.ДатаПоступления МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ДоКлиента)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	док.Распоряжение КАК Распоряжение,
	|	док.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ПОДСТРОКА(""0123456789"", ЧАС(док.ВремяДоставкиС) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"",
	|		СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ЧАС(док.ВремяДоставкиС))) / 6 + 1, 1) + "":"" +
	|		ПОДСТРОКА(""0123456789"", МИНУТА(док.ВремяДоставкиС) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"",
	|		СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МИНУТА(док.ВремяДоставкиС))) / 6 + 1, 1) + ""-"" +
	|		ПОДСТРОКА(""0123456789"", ЧАС(док.ВремяДоставкиПо) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"",
	|		СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * ЧАС(док.ВремяДоставкиПо))) / 6 + 1, 1) + "":"" +
	|		ПОДСТРОКА(""0123456789"", МИНУТА(док.ВремяДоставкиПо) / 10 + 1, 1) + ПОДСТРОКА(""0123456789"",
	|		СЕКУНДА(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1), СЕКУНДА, 6 * МИНУТА(док.ВремяДоставкиПо))) / 6 + 1, 1) КАК ВремяДоставки,
	|	док.ЗонаДоставки КАК ЗонаДоставки,
	|	док.АдресДоставки КАК АдресДоставки,
	|	док.Номер КАК Номер,
	|	док.Дата КАК Дата,
	|	док.СуммаДокумента КАК СуммаДокумента,
	|	док.Партнер КАК Партнер,
	|	док.КоличествоПалет КАК КоличествоПалет,
	|	док.КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	док.Вес КАК Вес,
	|	док.ВесПлан КАК ВесПлан,
	|	док.Объем КАК Объем,
	|	док.Подвоз КАК Подвоз,
	|	док.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	док.ЗонаДоставки.Наименование КАК ЗонаДоставкиНаименование,
	|	док.Порядок КАК Порядок
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|ГДЕ
	|	НЕ док.Распоряжение В
	|		(ВЫБРАТЬ
	|			ДокИзЛиста.Распоряжение КАК Распоряжение
	|		ИЗ
	|			ДокИзЛиста КАК ДокИзЛиста)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	МАКСИМУМ(Адреса.Расстояние) КАК Расстояние
	|ПОМЕСТИТЬ Км
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_АдресаДоставки КАК Адреса
	|		ПО вт.АдресДоставки = Адреса.Наименование
	|ГДЕ
	|	Адреса.Расстояние > 0
	|СГРУППИРОВАТЬ ПО
	|	вт.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Распоряжение КАК Распоряжение,
	|	вт.ДатаОтгрузки КАК ДатаОтгрузки,
	|	вт.ВремяДоставки КАК ВремяДоставки,
	|	вт.ЗонаДоставки КАК ЗонаДоставки,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.Номер КАК Номер,
	|	вт.Дата КАК Дата,
	|	вт.СуммаДокумента КАК СуммаДокумента,
	|	вт.Партнер КАК Партнер,
	|	вт.Партнер.Наименование КАК ПартнерНаименование,
	|	вт.КоличествоПалет КАК КоличествоПалет,
	|	вт.КоличествоПалетПлан КАК КоличествоПалетПлан,
	|	вт.Вес КАК Вес,
	|	вт.ВесПлан КАК ВесПлан,
	|	вт.Объем КАК Объем,
	|	вт.Подвоз КАК Подвоз,
	|	вт.УтвержденаОтгрузка КАК УтвержденаОтгрузка,
	|	Км.Расстояние КАК Расстояние,
	|	вт.Порядок КАК Порядок
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ Км КАК Км
	|		ПО вт.Распоряжение = Км.Распоряжение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подвоз,
	|	ПартнерНаименование,
	|	АдресДоставки";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ПалетРеал = ПалетРеал + ?(Выб.КоличествоПалетПлан = 0 Или Выб.КоличествоПалетПлан = Выб.КоличествоПалет, Выб.КоличествоПалет, Выб.КоличествоПалетПлан);
		ВесРеал   = ВесРеал + ?(Выб.ВесПлан = 0 Или Выб.ВесПлан = Выб.Вес, Выб.Вес, Выб.ВесПлан);

		Стр = Табл.Добавить();

		ЗаполнитьЗначенияСвойств(Стр, Выб);

		Стр.НомерСтроки = НомерСтроки;
		Стр.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выб.Номер);

		Если Стр.УтвержденаОтгрузка Тогда
			Стр.КоличествоПалетИнфо = Строка(Стр.КоличествоПалет);
			Стр.ВесИнфо             = Формат(Стр.Вес, "ЧДЦ=1");
		Иначе
			Стр.КоличествоПалетИнфо = ?(Стр.КоличествоПалетПлан = 0 Или Стр.КоличествоПалетПлан = Стр.КоличествоПалет, 
										Строка(Стр.КоличествоПалет), 
										Строка(Стр.КоличествоПалетПлан) + "/" + Строка(Стр.КоличествоПалет));
										
			Стр.ВесИнфо = ?(Стр.ВесПлан = 0 Или Стр.ВесПлан = Стр.Вес, Формат(Стр.Вес, "ЧДЦ=1"), Формат(Стр.ВесПлан, "ЧДЦ=1") + "/" + Формат(Стр.Вес, "ЧДЦ=1"));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьРегистры()
	Если Не Статус = Перечисления._СтатусыДоставки.Отправлено Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК ЛогистическийЛист,
	|	т.ТранспортноеСредство КАК ТранспортноеСредство,
	|	т.Водитель КАК Водитель,
	|	т.Пробег КАК Пробег,
	|	т.СтавкаВодителя КАК СтавкаВодителя,
	|	т.Коэффициент КАК Коэффициент,
	|	т.СтоимостьПропуска КАК СтоимостьПропуска,
	|	т.СтоимостьДоставки КАК СтоимостьДоставки,
	|	т.СтавкаАгента КАК СтавкаАгента
	|ПОМЕСТИТЬ Рейсы
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Рейсы КАК т
	|ГДЕ
	|	т.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряж.Ссылка.Организация КАК Организация,
	|	Распоряж.Распоряжение.Организация КАК ОрганизацияЗаказа,
	|	Распоряж.Распоряжение.Партнер КАК Партнер,
	|	Распоряж.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Распоряж.Ссылка КАК ЛогистическийЛист,
	|	Распоряж.Распоряжение КАК Распоряжение,
	|	Распоряж.Распоряжение.СуммаДокумента КАК СуммаДокумента,
	|	Распоряж.Распоряжение.AMS_Вес КАК Вес,
	|	Распоряж.Распоряжение.AMS_КоличествоПалет КАК КоличествоПалет,
	|	Распоряж.СтоимостьЧека КАК СтоимостьЧека,
	|	Распоряж.СуммаШтрафа КАК СуммаШтрафа,
	|	Распоряж.СуммаПретензии КАК СуммаПретензии,
	|	ПРЕДСТАВЛЕНИЕ(Распоряж.Распоряжение) КАК ПредставлениеРаспоряжения,
	|	Распоряж.ПунктДоговора КАК ПунктДоговора,
	|	Распоряж.СодержаниеПретензии КАК СодержаниеПретензии,
	|	Распоряж.Подвоз КАК Подвоз
	|ПОМЕСТИТЬ Док
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряж
	|ГДЕ
	|	Распоряж.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Возвраты.Организация,
	|	Возвраты.ОрганизацияЗаказа,
	|	Возвраты.Партнер,
	|	Возвраты.ТранспортноеСредство,
	|	Возвраты.Ссылка,
	|	НЕОПРЕДЕЛЕНО,
	|	Возвраты.СуммаДокумента,
	|	Возвраты.Вес,
	|	Возвраты.КоличествоПалет,
	|	Возвраты.СтоимостьЧека,
	|	Возвраты.СуммаШтрафа,
	|	Возвраты.СуммаПретензии,
	|	Возвраты.ПредставлениеРаспоряжения,
	|	Возвраты.ПунктДоговора,
	|	Возвраты.СодержаниеПретензии,
	|	Возвраты.Подвоз
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.ВозвратыТоваров КАК Возвраты
	|ГДЕ
	|	Возвраты.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.ТранспортноеСредство КАК ТранспортноеСредство,
	|	СУММА(Док.Вес) КАК Вес,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ Док.Подвоз
	|			ТОГДА Док.Вес
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ВесДоставка,
	|	СУММА(ВЫБОР
	|		КОГДА НЕ Док.Подвоз
	|			ТОГДА Док.КоличествоПалет
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоПалетДоставка,
	|	СУММА(ВЫБОР
	|		КОГДА Док.Подвоз
	|			ТОГДА Док.Вес
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ВесПодвоз,
	|	СУММА(ВЫБОР
	|		КОГДА Док.Подвоз
	|			ТОГДА Док.КоличествоПалет
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КоличествоПалетПодвоз,
	|	МАКСИМУМ(Рейсы.СтоимостьДоставки) КАК СтоимостьДоставки
	|ПОМЕСТИТЬ Расчет
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Рейсы КАК Рейсы
	|		ПО Док.ТранспортноеСредство = Рейсы.ТранспортноеСредство
	|СГРУППИРОВАТЬ ПО
	|	Док.ТранспортноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Док.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	Расчет.СтоимостьДоставки * Док.Вес / Расчет.Вес КАК ЦенаДоставки
	|ПОМЕСТИТЬ Цен
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Расчет КАК Расчет
	|		ПО Док.ТранспортноеСредство = Расчет.ТранспортноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рейсы.ЛогистическийЛист КАК Регистратор,
	|	Рейсы.ЛогистическийЛист.Дата КАК Период,
	|	Рейсы.ТранспортноеСредство._Перевозчик КАК Перевозчик,
	|	Рейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Рейсы.Водитель КАК Водитель,
	|	Рейсы.Пробег КАК Пробег,
	|	Расчет.ВесДоставка КАК ВесДоставка,
	|	Расчет.КоличествоПалетДоставка КАК КоличествоПалетДоставка,
	|	Расчет.ВесПодвоз КАК ВесПодвоз,
	|	Расчет.КоличествоПалетПодвоз КАК КоличествоПалетПодвоз,
	|	Рейсы.СтавкаВодителя КАК СтавкаВодителя,
	|	Рейсы.СтоимостьПропуска КАК СтоимостьПропуска,
	|	Рейсы.СтоимостьДоставки КАК СтоимостьДоставки,
	|	Рейсы.СтавкаАгента КАК СтавкаАгента,
	|	Рейсы.Коэффициент КАК Коэффициент
	|ИЗ
	|	Рейсы КАК Рейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Расчет КАК Расчет
	|		ПО Рейсы.ТранспортноеСредство = Расчет.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.ЛогистическийЛист КАК Регистратор,
	|	Док.ЛогистическийЛист.Дата КАК Период,
	|	Док.Организация КАК Организация,
	|	Док.ОрганизацияЗаказа КАК ОрганизацияЗаказа,
	|	Док.Партнер КАК Партнер,
	|	Док.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Док.Распоряжение КАК Распоряжение,
	|	Док.СуммаДокумента КАК СуммаДокумента,
	|	Док.Вес КАК Вес,
	|	Док.КоличествоПалет КАК КоличествоПалет,
	|	Цен.ЦенаДоставки КАК ЦенаДоставки,
	|	Док.СтоимостьЧека КАК СтоимостьЧека,
	|	Док.СуммаШтрафа КАК СуммаШтрафа,
	|	Док.СуммаПретензии КАК СуммаПретензии,
	|	Док.ПредставлениеРаспоряжения КАК ПредставлениеРаспоряжения,
	|	Док.ПунктДоговора КАК ПунктДоговора,
	|	Док.СодержаниеПретензии КАК СодержаниеПретензии,
	|	Док.Подвоз КАК Подвоз
	|ИЗ
	|	Док КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цен КАК Цен
	|		ПО Док.ТранспортноеСредство = Цен.ТранспортноеСредство
	|		И Док.ПредставлениеРаспоряжения = Цен.ПредставлениеРаспоряжения";

	Пакет = Запрос.ВыполнитьПакет();

	Выб = Пакет[4].Выбрать();

	Движения._Рейсы.Записывать = Истина;

	Пока Выб.Следующий() Цикл
		Движение = Движения._Рейсы.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выб);
	КонецЦикла;

	Выб = Пакет[5].Выбрать();

	Движения._РейсыРаспоряжения.Записывать = Истина;

	Пока Выб.Следующий() Цикл
		Движение = Движения._РейсыРаспоряжения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выб);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьРегистрыСведенийИсторияРеализации()
	Если Не Статус = Перечисления._СтатусыДоставки.Погрузка Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛогистическийЛист", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реализация.Ссылка КАК РеализацияТоваровУслуг,
	|	Реализация.AMS_УтвержденаОтгрузка КАК УтвержденаОтгрузка
	|ПОМЕСТИТЬ Реализации
	|ИЗ
	|	Документ.AMS_ЛогистическийЛист.Распоряжения КАК Распоряжения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК Реализация
	|		ПО Распоряжения.Распоряжение = Реализация.Ссылка
	|ГДЕ
	|	Распоряжения.Ссылка = &ЛогистическийЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	История.Период КАК Период,
	|	История.Документ КАК Документ,
	|	История.Операция КАК Операция,
	|	История.ЛогистическийЛист КАК ЛогистическийЛист
	|ПОМЕСТИТЬ РегИстория
	|ИЗ
	|	РегистрСведений.AMS_ИсторияРеализации КАК История
	|ГДЕ
	|	История.Документ В
	|		(ВЫБРАТЬ
	|			т.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ИЗ
	|			Реализации КАК т)
	|	И История.Операция В (""Погрузка"", ""Отмена погрузки"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегИстория.Документ КАК Документ,
	|	МАКСИМУМ(РегИстория.Период) КАК Период
	|ПОМЕСТИТЬ ДатыПоследнихОпераций
	|ИЗ
	|	РегИстория КАК РегИстория
	|СГРУППИРОВАТЬ ПО
	|	РегИстория.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегИстория.Период КАК Период,
	|	РегИстория.Документ КАК Документ,
	|	РегИстория.Операция КАК Операция,
	|	РегИстория.ЛогистическийЛист КАК ЛогистическийЛист
	|ПОМЕСТИТЬ ПоследнииОперации
	|ИЗ
	|	РегИстория КАК РегИстория
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПоследнихОпераций КАК ДатыПоследнихОпераций
	|		ПО РегИстория.Период = ДатыПоследнихОпераций.Период
	|		И РегИстория.Документ = ДатыПоследнихОпераций.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реализации.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ИЗ
	|	Реализации КАК Реализации
	|ГДЕ
	|	Реализации.УтвержденаОтгрузка
	|	И НЕ Реализации.РеализацияТоваровУслуг В
	|		(ВЫБРАТЬ
	|			ПоследнииОперации.Документ КАК Документ
	|		ИЗ
	|			ПоследнииОперации КАК ПоследнииОперации
	|		ГДЕ
	|			ПоследнииОперации.Операция = ""Погрузка"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реализации.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ИЗ
	|	Реализации КАК Реализации
	|ГДЕ
	|	НЕ Реализации.УтвержденаОтгрузка
	|	И Реализации.РеализацияТоваровУслуг В
	|		(ВЫБРАТЬ
	|			ПоследнииОперации.Документ КАК Документ
	|		ИЗ
	|			ПоследнииОперации КАК ПоследнииОперации
	|		ГДЕ
	|			ПоследнииОперации.Операция = ""Погрузка"")";

	Пакет = Запрос.ВыполнитьПакет();

	Выб = Пакет[4].Выбрать();
	Пока Выб.Следующий() Цикл
		РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Выб.РеализацияТоваровУслуг, 
			Перечисления.AMS_СобытияРеализации.Погрузка,,Ссылка);
	КонецЦикла;

	Выб = Пакет[5].Выбрать();
	Пока Выб.Следующий() Цикл
		РегистрыСведений.AMS_ИсторияРеализации.ЗаписатьСобытиеДокумента(Выб.РеализацияТоваровУслуг,
			Перечисления.AMS_СобытияРеализации.ОтменаПогрузки,,Документы.AMS_ЛогистическийЛист.ПустаяСсылка());
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
